In [1]:
import pandas as pd
import numpy as np

In [102]:
customer = pd.read_csv('customer.csv')

In [103]:
customer

   id   name
0   1    tom
1   2  jerry
2   3    sam
3   4   lucy
4   5   lily

In [57]:
buy = pd.read_csv('buy.csv')

In [58]:
buy

   id   name    item
0   1    tom  iphone
1   2    tom   watch
2   3  jerry     g10
3   4   lily      g9
4   5    sam    ipad

In [59]:
item = buy.groupby('name').item.count().to_frame().reset_index()

In [60]:
item

    name  item
0  jerry     1
1   lily     1
2    sam     1
3    tom     2

### with pandas

In [61]:
customer.merge(item, on='name', how='left')

   id   name  item
0   1    tom   2.0
1   2  jerry   1.0
2   3    sam   1.0
3   4   lucy   NaN
4   5   lily   1.0

### for loop

In [87]:
for idx, row in customer.iterrows():
    for idx2, obs in item.iterrows():
        if row['name']==obs['name']:
            customer.loc[idx, 'item'] = obs['item']

In [88]:
customer

   id   name item
0   1    tom    2
1   2  jerry    1
2   3    sam    1
3   4   lucy  NaN
4   5   lily    1

### hash table

In [96]:
d2 = {}
for idx, row in item.iterrows():
    d2[row['name']] = item.loc[idx, 'item']

In [97]:
d2

{'jerry': 1, 'lily': 1, 'sam': 1, 'tom': 2}

In [106]:
for idx, row in customer.iterrows():
    if row['name'] in d2:
        customer.loc[idx,'item2'] = d2[row['name']]

In [107]:
customer

   id   name  item2
0   1    tom    2.0
1   2  jerry    1.0
2   3    sam    1.0
3   4   lucy    NaN
4   5   lily    1.0

### random number

generate 10 random numbers between 0-1, and calculate the mean and variance of the difference between the smallest and second smallest

In [111]:
d = []
for i in range(100):
    n = sorted(np.random.random((10,)))
    d.append(n[1]-n[0])
print np.mean(d)
print np.var(d)

generate 1000 numbers consist of 0,1,2 with prob of 0.2, 0.3, 0.5

In [118]:
d = []
for i in range(1000):
    d.append(np.random.choice(a=[0,1,2], p=[0.2,0.3,0.5]))
d.count(2)